/**
 * @file libs_config.h
 * @author Аль-Вади Омар 
 * @brief Файл содержит основные конфигурации для проекта также с конфигурации для кросскомпиляции
 * @version 0.1
 * @date 2020-01-18
 * 
 * @copyright Copyright (c) 2020
 * 
 */

#ifndef H_LIBS_CONFIG_H
#define H_LIBS_CONFIG_H

/****************************************************
 ********************* WINDOWS **********************
 ***************************************************/
#ifdef _WIN_32_
#define SH_MEM_BUF_SIZE 256

// Конфигурации для модуля управления общей памяти 


// Конфигурация для OPC UA Server

#endif
/****************************************************
 ********************* UNIX **********************
 ***************************************************/


#endif //H_LIBS_CONFIG_H